Revit 2027 API
ScheduleField.CanTotal Method
 Indicates if totals can be enabled for this field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanTotal()
Public Function CanTotal As Boolean
public:
bool CanTotal()
member CanTotal : unit -> bool
Return Value
Boolean
 True if this field can be totaled, false otherwise.
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace